## singleIndex 만들기

In [1]:
import pandas as pd
import numpy as np


data = {'Act': np.random.randint(50, 100, 9), 'Breath': np.random.randint(50, 100, 9)}
df = pd.DataFrame(data, columns=['Act', 'Breath'],
                  index=['Adams','Adams','Adams', 'Moses', 'Moses', 'Moses','Miriam','Miriam','Miriam'])
df

        Act  Breath
Adams    70      99
Adams    81      55
Adams    71      88
Moses    86      78
Moses    82      57
Moses    53      81
Miriam   60      77
Miriam   62      90
Miriam   98      60

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, Adams to Miriam
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Act     9 non-null      int32
 1   Breath  9 non-null      int32
dtypes: int32(2)
memory usage: 144.0+ bytes

In [3]:
df.loc['Adams']

       Act  Breath
Adams   70      99
Adams   81      55
Adams   71      88

## multiindex 만들기

In [4]:
import pandas as pd
import numpy as np


# activities_val = {'20230102': 
#                   ['Act': [80, 70, 75],
#                    'Breath': [80, 70, 75]], 
#                   '20230103': 
#                     [90,75,82], '20230104':[95, 72, 89]}
# df = pd.DataFrame(data=activities_val, index=['Adams', 'Moses', 'Miriam'])
# df


# pd.DataFrame(np.random.randint(50, 100, 6).reshape(3,2), index=[['Adams', 'Moses', 'Miriam'], ['20230102','20230103','20230104']],
#             columns=['Act', 'Breath'])


multi_idx_df = pd.DataFrame(np.random.randint(50, 100, 18).reshape(9,2),
             index=[['Adams','Adams','Adams', 'Moses', 'Moses', 'Moses','Miriam','Miriam','Miriam'],
                    ['20230102','20230103','20230104','20230102','20230103','20230104','20230102','20230103','20230104']],
            columns=['Act', 'Breath'])

multi_idx_df

                 Act  Breath
Adams  20230102   72      51
       20230103   63      60
       20230104   94      80
Moses  20230102   50      92
       20230103   75      87
       20230104   79      78
Miriam 20230102   63      97
       20230103   91      97
       20230104   93      64

In [5]:
multi_idx_df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 9 entries, ('Adams', '20230102') to ('Miriam', '20230104')
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Act     9 non-null      int32
 1   Breath  9 non-null      int32
dtypes: int32(2)
memory usage: 386.0+ bytes

In [6]:
multi_idx_df.sort_index()
multi_idx_df.loc['Adams','20230102']

Act       72
Breath    51
Name: (Adams, 20230102), dtype: int32

## from_product로 multiindex 만들기

In [7]:
idx = pd.MultiIndex.from_product([['Adams','Moses', 'Miriam'], ['20230102','20230103','20230104']])
idx.names = ['FirstName','Date']
multi_idx_product_df = pd.DataFrame(np.random.randint(50, 100, 18).reshape(9,2),
             index=idx,
            columns=['Act', 'Breath'])


multi_idx_product_df

                    Act  Breath
FirstName Date
Adams     20230102   67      85
          20230103   68      95
          20230104   51      76
Moses     20230102   82      57
          20230103   89      55
          20230104   99      92
Miriam    20230102   85      96
          20230103   93      82
          20230104   52      66

## from_tuples로 multiIndex만들기

In [8]:
tuple_index = \
  [('Adams', '20230102'), ('Adams', '20230103'), ('Adams', '20230104'),
  ('Moses', '20230102'),('Moses', '20230103'),('Moses', '20230104'),
  ('Miriam', '20230102'),('Miriam', '20230103'),('Miriam', '2023010')
  ]
multi_index = pd.MultiIndex.from_tuples(tuple_index)
multi_index.names = ['FirstName','Date']

pd.DataFrame(data=np.random.randint(50, 100, 18).reshape(9,2),
              index=multi_index, columns=['Act', 'Breath'])

                    Act  Breath
FirstName Date
Adams     20230102   64      64
          20230103   58      93
          20230104   80      87
Moses     20230102   74      66
          20230103   91      98
          20230104   59      89
Miriam    20230102   67      65
          20230103   93      83
          2023010    60      89

In [9]:
multi_idx_product_df.loc['Adams','20230102'] = (57, 83)
multi_idx_product_df.loc['Adams','20230103'] = (82, 62)
multi_idx_product_df.loc['Adams','20230104'] = (75, 69)


multi_idx_product_df.loc['Miriam','20230102'] = (68, 99)
multi_idx_product_df.loc['Miriam','20230103'] = (99, 87)
multi_idx_product_df.loc['Miriam','20230104'] = (63, 62)

multi_idx_product_df.loc['Moses','20230102'] = (81, 88)
multi_idx_product_df.loc['Moses','20230103'] = (78, 86)
multi_idx_product_df.loc['Moses','20230104'] = (76, 78)

In [10]:
multi_idx_product_df.index

MultiIndex([( 'Adams', '20230102'),
            ( 'Adams', '20230103'),
            ( 'Adams', '20230104'),
            ( 'Moses', '20230102'),
            ( 'Moses', '20230103'),
            ( 'Moses', '20230104'),
            ('Miriam', '20230102'),
            ('Miriam', '20230103'),
            ('Miriam', '20230104')],
           names=['FirstName', 'Date'])

In [11]:
multi_idx_product_df.sort_index(inplace=True)
multi_idx_product_df

                    Act  Breath
FirstName Date
Adams     20230102   57      83
          20230103   82      62
          20230104   75      69
Miriam    20230102   68      99
          20230103   99      87
          20230104   63      62
Moses     20230102   81      88
          20230103   78      86
          20230104   76      78

In [12]:
multi_idx_product_df.index.names = ['FirstName', 'Date']

In [13]:
multi_idx_product_df

                    Act  Breath
FirstName Date
Adams     20230102   57      83
          20230103   82      62
          20230104   75      69
Miriam    20230102   68      99
          20230103   99      87
          20230104   63      62
Moses     20230102   81      88
          20230103   78      86
          20230104   76      78

## loc, iloc로 데이터 접근하기

In [14]:
# 명시적 인덱스로 접근
multi_idx_product_df.loc['Adams',:]

          Act  Breath
Date
20230102   57      83
20230103   82      62
20230104   75      69

In [15]:
# 명시적 인덱스로 접근 
multi_idx_product_df.loc['Adams','20230103']

Act       82
Breath    62
Name: (Adams, 20230103), dtype: int32

In [16]:
# 팬시인덱싱도 가능함
multi_idx_product_df.loc[['Adams','Miriam']]

                    Act  Breath
FirstName Date
Adams     20230102   57      83
          20230103   82      62
          20230104   75      69
Miriam    20230102   68      99
          20230103   99      87
          20230104   63      62

In [17]:
# 암묵적 인덱스로 접근(3행까지, 1열까지)
multi_idx_product_df.iloc[:3, :1]

                    Act
FirstName Date
Adams     20230102   57
          20230103   82
          20230104   75

In [18]:
multi_idx_product_df.index

MultiIndex([( 'Adams', '20230102'),
            ( 'Adams', '20230103'),
            ( 'Adams', '20230104'),
            ('Miriam', '20230102'),
            ('Miriam', '20230103'),
            ('Miriam', '20230104'),
            ( 'Moses', '20230102'),
            ( 'Moses', '20230103'),
            ( 'Moses', '20230104')],
           names=['FirstName', 'Date'])

In [19]:
multi_idx_product_df.loc[:, '20230102']
# 실패했다. 멀티인덱스에서 loc 사용에는 한계가 있음

KeyError: '20230102'

In [ ]:
# 명시적 인덱스로 접근
# multi_idx_df.loc[:, slice('20230104')]
# multi_idx_df.loc[:, ('20230103')]
# multi_idx_df.loc[(), '20230103']

# multi_idx_df.loc[pd.IndexSlice[: , '20230103']]
# idx = pd.IndexSlice
# multi_idx_df.loc[idx[:5], idx[:]]

# multi_idx_df.loc[("Adams", ""), slice(None)]


# 성공: slice함수
multi_idx_product_df.loc[(slice(None), '20230102'), :]

                    Act  Breath
FirstName Date
Adams     20230102   82      85
Moses     20230102   78      68
Miriam    20230102   94      55

In [22]:
#pd.IndexSlice으로 레벨1조회
idx = pd.IndexSlice
multi_idx_product_df.loc[ idx[:, '20230102'], : ]

                    Act  Breath
FirstName Date
Adams     20230102   57      83
Miriam    20230102   68      99
Moses     20230102   81      88

In [23]:
# query함수로 레벨1 조회
multi_idx_product_df.query("Date == '20230102'")

                    Act  Breath
FirstName Date
Adams     20230102   57      83
Miriam    20230102   68      99
Moses     20230102   81      88

In [24]:
multi_index.get_level_values(0)

Index(['Adams', 'Adams', 'Adams', 'Moses', 'Moses', 'Moses', 'Miriam',
       'Miriam', 'Miriam'],
      dtype='object', name='FirstName')

In [25]:
multi_index.get_level_values(1)

Index(['20230102', '20230103', '20230104', '20230102', '20230103', '20230104',
       '20230102', '20230103', '2023010'],
      dtype='object', name='Date')

In [26]:
multi_index.get_loc_level('20230102',level='Date')

(array([ True, False, False,  True, False, False,  True, False, False]),
 Index(['Adams', 'Moses', 'Miriam'], dtype='object', name='FirstName'))

In [27]:
multi_idx_product_df['Act']
# 칼럼 조회

FirstName  Date
Adams      20230102    57
           20230103    82
           20230104    75
Miriam     20230102    68
           20230103    99
           20230104    63
Moses      20230102    81
           20230103    78
           20230104    76
Name: Act, dtype: int32

## XS로 조회하기

In [28]:
# 20230103 일자 모든 환자의 '활동지수' 및 '호흡지수' 조회
multi_idx_product_df.xs('20230103', level='Date')

           Act  Breath
FirstName
Adams       82      62
Miriam      99      87
Moses       78      86

In [29]:
multi_idx_product_df

                    Act  Breath
FirstName Date
Adams     20230102   57      83
          20230103   82      62
          20230104   75      69
Miriam    20230102   68      99
          20230103   99      87
          20230104   63      62
Moses     20230102   81      88
          20230103   78      86
          20230104   76      78

In [30]:
multi_idx_product_df.xs('20230103', level=1, drop_level=False)

                    Act  Breath
FirstName Date
Adams     20230103   82      62
Miriam    20230103   99      87
Moses     20230103   78      86

## 인덱스 설정 및 해제

In [31]:
multi_idx_product_df.unstack(level=1)

               Act                     Breath
Date      20230102 20230103 20230104 20230102 20230103 20230104
FirstName
Adams           57       82       75       83       62       69
Miriam          68       99       63       99       87       62
Moses           81       78       76       88       86       78

In [32]:
multi_idx_product_df.unstack(level=0)

            Act              Breath
FirstName Adams Miriam Moses  Adams Miriam Moses
Date
20230102     57     68    81     83     99    88
20230103     82     99    78     62     87    86
20230104     75     63    76     69     62    78

In [33]:
df2 = multi_idx_product_df.unstack(level=0)
df2

            Act              Breath
FirstName Adams Miriam Moses  Adams Miriam Moses
Date
20230102     57     68    81     83     99    88
20230103     82     99    78     62     87    86
20230104     75     63    76     69     62    78

In [34]:
df2.index

Index(['20230102', '20230103', '20230104'], dtype='object', name='Date')

In [35]:
df2.loc['20230102']

        FirstName
Act     Adams        57
        Miriam       68
        Moses        81
Breath  Adams        83
        Miriam       99
        Moses        88
Name: 20230102, dtype: int32

### 인덱스 해제

In [36]:
no_index_df = multi_idx_product_df.reset_index()
no_index_df

  FirstName      Date  Act  Breath
0     Adams  20230102   57      83
1     Adams  20230103   82      62
2     Adams  20230104   75      69
3    Miriam  20230102   68      99
4    Miriam  20230103   99      87
5    Miriam  20230104   63      62
6     Moses  20230102   81      88
7     Moses  20230103   78      86
8     Moses  20230104   76      78

In [37]:
no_index_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   FirstName  9 non-null      object
 1   Date       9 non-null      object
 2   Act        9 non-null      int32
 3   Breath     9 non-null      int32
dtypes: int32(2), object(2)
memory usage: 344.0+ bytes

### 인덱스 설정

In [38]:
no_index_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   FirstName  9 non-null      object
 1   Date       9 non-null      object
 2   Act        9 non-null      int32
 3   Breath     9 non-null      int32
dtypes: int32(2), object(2)
memory usage: 344.0+ bytes

In [39]:
set_index_df = no_index_df.set_index(['FirstName', 'Date'])
set_index_df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 9 entries, ('Adams', '20230102') to ('Moses', '20230104')
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Act     9 non-null      int32
 1   Breath  9 non-null      int32
dtypes: int32(2)
memory usage: 465.0+ bytes

In [40]:
changed_level = set_index_df.swaplevel('FirstName', 'Date')
changed_level

                    Act  Breath
Date     FirstName
20230102 Adams       57      83
20230103 Adams       82      62
20230104 Adams       75      69
20230102 Miriam      68      99
20230103 Miriam      99      87
20230104 Miriam      63      62
20230102 Moses       81      88
20230103 Moses       78      86
20230104 Moses       76      78

In [41]:
changed_level.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 9 entries, ('20230102', 'Adams') to ('20230104', 'Moses')
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Act     9 non-null      int32
 1   Breath  9 non-null      int32
dtypes: int32(2)
memory usage: 465.0+ bytes

In [55]:
no_index_df

  FirstName      Date  Act  Breath
0     Adams  20230102   57      83
1     Adams  20230103   82      62
2     Adams  20230104   75      69
3    Miriam  20230102   68      99
4    Miriam  20230103   99      87
5    Miriam  20230104   63      62
6     Moses  20230102   81      88
7     Moses  20230103   78      86
8     Moses  20230104   76      78

## reindex 다루기

In [66]:
idx = ['Seoul','Pusan', 'Jeju']
df = pd.DataFrame(np.random.randint(50, 100, 3).reshape(3,1),
             index=idx)
df

        0
Seoul  91
Pusan  76
Jeju   58

In [72]:
df.reindex(['Daejon', 'Seoul'], method='ffill')

         0
Daejon  58
Seoul   91

In [58]:
no_index_df.set_index(['Adams', 'Miriam', 'Moses'])

KeyError: "None of ['Adams', 'Miriam', 'Moses'] are in the columns"

## 간단한 집계구하기

In [42]:
multi_idx_product_df

                    Act  Breath
FirstName Date
Adams     20230102   57      83
          20230103   82      62
          20230104   75      69
Miriam    20230102   68      99
          20230103   99      87
          20230104   63      62
Moses     20230102   81      88
          20230103   78      86
          20230104   76      78

In [43]:
multi_idx_product_df.mean(level='FirstName')

C:\Users\sunin\AppData\Local\Temp\ipykernel_31812\1986564839.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  multi_idx_product_df.mean(level='FirstName')

                 Act     Breath
FirstName
Adams      71.333333  71.333333
Miriam     76.666667  82.666667
Moses      78.333333  84.000000

In [44]:
df_mean=multi_idx_product_df.mean(level='FirstName')

C:\Users\sunin\AppData\Local\Temp\ipykernel_31812\1254594780.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  df_mean=multi_idx_product_df.mean(level='FirstName')

In [45]:
df_mean.max(axis=1)

FirstName
Adams     71.333333
Miriam    82.666667
Moses     84.000000
dtype: float64

In [46]:
multi_idx_product_df.sum(level='FirstName')

C:\Users\sunin\AppData\Local\Temp\ipykernel_31812\1514279894.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  multi_idx_product_df.sum(level='FirstName')

           Act  Breath
FirstName
Adams      214     214
Miriam     230     248
Moses      235     252

In [47]:
multi_idx_product_df.mean(level='FirstName')

C:\Users\sunin\AppData\Local\Temp\ipykernel_31812\1986564839.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  multi_idx_product_df.mean(level='FirstName')

                 Act     Breath
FirstName
Adams      71.333333  71.333333
Miriam     76.666667  82.666667
Moses      78.333333  84.000000

In [48]:
multi_idx_product_df.min(level='Date')

C:\Users\sunin\AppData\Local\Temp\ipykernel_31812\1538019068.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  multi_idx_product_df.min(level='Date')

          Act  Breath
Date
20230102   57      83
20230103   78      62
20230104   63      62

In [49]:
multi_idx_product_df.sum(level='Date')

C:\Users\sunin\AppData\Local\Temp\ipykernel_31812\1466057919.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  multi_idx_product_df.sum(level='Date')

          Act  Breath
Date
20230102  206     270
20230103  259     235
20230104  214     209

In [50]:
multi_idx_product_df.groupby(level='FirstName').sum()

           Act  Breath
FirstName
Adams      214     214
Miriam     230     248
Moses      235     252

## 슬라이싱

In [51]:
multi_idx_product_df

                    Act  Breath
FirstName Date
Adams     20230102   57      83
          20230103   82      62
          20230104   75      69
Miriam    20230102   68      99
          20230103   99      87
          20230104   63      62
Moses     20230102   81      88
          20230103   78      86
          20230104   76      78

In [52]:
multi_idx_product_df[ multi_idx_product_df['Act'] > 80]

                    Act  Breath
FirstName Date
Adams     20230103   82      62
Miriam    20230103   99      87
Moses     20230102   81      88

In [53]:
multi_idx_product_df['Act']

FirstName  Date
Adams      20230102    57
           20230103    82
           20230104    75
Miriam     20230102    68
           20230103    99
           20230104    63
Moses      20230102    81
           20230103    78
           20230104    76
Name: Act, dtype: int32

In [54]:
multi_idx_product_df['Adams':'Moses']

                    Act  Breath
FirstName Date
Adams     20230102   57      83
          20230103   82      62
          20230104   75      69
Miriam    20230102   68      99
          20230103   99      87
          20230104   63      62
Moses     20230102   81      88
          20230103   78      86
          20230104   76      78